package main

import "strconv"

//累加数是一个字符串，组成它的数字可以形成累加序列。
//
// 一个有效的累加序列必须至少包含 3 个数。除了最开始的两个数以外，字符串中的其他数都等于它之前两个数相加的和。 
//
// 给定一个只包含数字 '0'-'9' 的字符串，编写一个算法来判断给定输入是否是累加数。 
//
// 说明: 累加序列里的数不会以 0 开头，所以不会出现 1, 2, 03 或者 1, 02, 3 的情况。 
//
// 示例 1: 
//
// 输入: "112358"
//输出: true 
//解释: 累加序列为: 1, 1, 2, 3, 5, 8 。1 + 1 = 2, 1 + 2 = 3, 2 + 3 = 5, 3 + 5 = 8
// 
//
// 示例 2: 
//
// 输入: "199100199"
//输出: true 
//解释: 累加序列为: 1, 99, 100, 199。1 + 99 = 100, 99 + 100 = 199 
//
// 进阶: 
//你如何处理一个溢出的过大的整数输入? 
// Related Topics 回溯算法 
// 👍 102 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
func isAdditiveNumber(num string) bool {
	ret := false
	//l,ml := len(num),len(num)/2 //单个数字长度不大于ml
	trace := func(cnt,n1,n2 int,rest string) {}
	// cnt 是目前池内数字，当cnt > 2 才会判断
	// rest 是可选择的string

	trace = func(cnt, n1, n2 int, rest string) {
		if len(rest) == 0 {
			if cnt > 2 {
				ret = true
			}
			return
		}

		//开始从rest中取值，添加分支并剪枝
		n3 := ""
		for _,e := range rest {
			n3 = n3+string(e)
			// 0 可以新建分支 01 02 则剪枝
			if n3[0]=='0' && len(n3)!=1 {
				// 剪枝
				return
			}
			e,_ := strconv.Atoi(n3)
			if cnt >= 2 {
				if e == n1+n2 { //判断是否可以新建分支
					// 新建分支
					trace(cnt+1,n2,e,rest[len(n3):])
				}
			}else {
				// 新建分支
				trace(cnt+1,n2,e,rest[len(n3):])
			}
			if ret {
				// 已有答案，剪枝
				return
			}
		}
	}

	//199100199
	//
	trace(0,0,0,num)
	return ret
}
//leetcode submit region end(Prohibit modification and deletion)
















